ОсновныеОбъектыЗанятие6/src/Documents/ПриказОПриеме/ПриказОПриеме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОПриеме</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ОсновныеОбъектыЗанятие6/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Неприкасаемые</name>
      <description>Неприкасаемые</description>
    </items>
    <items>
      <name>Принятые</name>
      <description>Принятые</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяКнижка</name>
    <attributes>
      <name>МестоРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ОсновныеОбъектыЗанятие6/src/Documents/ПриказОПриеме/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//--ДЗ 1.5.3 -----
	Если Сотрудник.Родитель = Справочники.Сотрудники.Неприкасаемые Тогда
	
		Отказ = Истина;
	
	КонецЕсли;
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ДЗ 1.5.7
	СтрокаДолжность = Подразделение.Должности.Найти(Должность,"Должность");
	
	Если СтрокаДолжность = Неопределено Тогда
		
		Сообщить("В подразделении " + Подразделение + " нет такой должности " + Должность);
		Сообщить("Нельзя провести такой документ!");
		
		Возврат;
		
	КонецЕсли;
	
	Если СтавкаОклада > Должность.СтавкаОклада Тогда
		
		Сообщить("Ставка оклада по документу превышает ставку оклада должности!");
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда

		Сотрудник = ДанныеЗаполнения;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Должность = ДанныеЗаполнения.Должность;
		СтавкаОклада = ДанныеЗаполнения.СтавкаОклада;

	КонецЕсли;


КонецПроцедуры
